Script started on 2020-02-06 13:12:21-05:00 [TERM="xterm-256color" TTY="/dev/pts/0" COLUMNS="80" LINES="24"]
bash: /home/umrigar/cs240/bin/student.rc: Permission denied
rblazej1@g7-10:~/i240a/submit/lab2$ cp -r ~/cs240/lb[Kabs/lab2/exercises/* .
cp: cannot stat '/home/rblazej1/cs240/labs/lab2/exercises/*': No such file or directory
rblazej1@g7-10:~/i240a/submit/lab2$ cd ..
rblazej1@g7-10:~/i240a/submit$ cd ..
rblazej1@g7-10:~/i240a$ cd ..
rblazej1@g7-10:~$ ls
240		      cs120	 git-repos  ls.log    Templates       v.c
addarray	      cs220	 hello	    lss.log   tinyproc2       Videos
Adders_Circuits.circ  cs240	 i240a	    Music     tinyproc2.circ  x.c
Arduino		      Desktop	 lab	    Pictures  tinyproc2.s
assembler-lab.c       dir	 lab10.asm  projects  tl.c
cat.log		      Documents  lab1.txt   Public    tmp
crontab		      Downloads  lab5.c     T1.s      v1.s
rblazej1@g7-10:~$ cd cs240
rblazej1@g7-10:~/cs240$ ls
announce.html  docs	      hws	  labs	    README.md
announce.umt   exams-quizzes  index.html  misc	    slides
assets	       exercises      index.umt   projects  umt.make
rblazej1@g7-10:~/cs240$ gitpu[K[K pull
/home/rblazej1/.bashrc: line 1: /home/umrigar/cs240/bin/student.rc: Permission denied
remote: Enumerating objects: 105, done.[K
remote: Counting objects:   0% (1/105)   [Kremote: Counting objects:   1% (2/105)   [Kremote: Counting objects:   2% (3/105)   [Kremote: Counting objects:   3% (4/105)   [Kremote: Counting objects:   4% (5/105)   [Kremote: Counting objects:   5% (6/105)   [Kremote: Counting objects:   6% (7/105)   [Kremote: Counting objects:   7% (8/105)   [Kremote: Counting objects:   8% (9/105)   [Kremote: Counting objects:   9% (10/105)   [Kremote: Counting objects:  10% (11/105)   [Kremote: Counting objects:  11% (12/105)   [Kremote: Counting objects:  12% (13/105)   [Kremote: Counting objects:  13% (14/105)   [Kremote: Counting objects:  14% (15/105)   [Kremote: Counting objects:  15% (16/105)   [Kremote: Counting objects:  16% (17/105)   [Kremote: Counting objects:  17% (18/105)   [Kremote: Counting objects:  18% (19/105)   [Kremote: Counting objects:  19% (20/105)   [Kremote: Counting objects:  20% (21/105)   [Kremote: Counting objects:  21% (23/105)   [Kremote: Counting objects:  22% (24/105)   [Kremote: Counting objects:  23% (25/105)   [Kremote: Counting objects:  24% (26/105)   [Kremote: Counting objects:  25% (27/105)   [Kremote: Counting objects:  26% (28/105)   [Kremote: Counting objects:  27% (29/105)   [Kremote: Counting objects:  28% (30/105)   [Kremote: Counting objects:  29% (31/105)   [Kremote: Counting objects:  30% (32/105)   [Kremote: Counting objects:  31% (33/105)   [Kremote: Counting objects:  32% (34/105)   [Kremote: Counting objects:  33% (35/105)   [Kremote: Counting objects:  34% (36/105)   [Kremote: Counting objects:  35% (37/105)   [Kremote: Counting objects:  36% (38/105)   [Kremote: Counting objects:  37% (39/105)   [Kremote: Counting objects:  38% (40/105)   [Kremote: Counting objects:  39% (41/105)   [Kremote: Counting objects:  40% (42/105)   [Kremote: Counting objects:  41% (44/105)   [Kremote: Counting objects:  42% (45/105)   [Kremote: Counting objects:  43% (46/105)   [Kremote: Counting objects:  44% (47/105)   [Kremote: Counting objects:  45% (48/105)   [Kremote: Counting objects:  46% (49/105)   [Kremote: Counting objects:  47% (50/105)   [Kremote: Counting objects:  48% (51/105)   [Kremote: Counting objects:  49% (52/105)   [Kremote: Counting objects:  50% (53/105)   [Kremote: Counting objects:  51% (54/105)   [Kremote: Counting objects:  52% (55/105)   [Kremote: Counting objects:  53% (56/105)   [Kremote: Counting objects:  54% (57/105)   [Kremote: Counting objects:  55% (58/105)   [Kremote: Counting objects:  56% (59/105)   [Kremote: Counting objects:  57% (60/105)   [Kremote: Counting objects:  58% (61/105)   [Kremote: Counting objects:  59% (62/105)   [Kremote: Counting objects:  60% (63/105)   [Kremote: Counting objects:  61% (65/105)   [Kremote: Counting objects:  62% (66/105)   [Kremote: Counting objects:  63% (67/105)   [Kremote: Counting objects:  64% (68/105)   [Kremote: Counting objects:  65% (69/105)   [Kremote: Counting objects:  66% (70/105)   [Kremote: Counting objects:  67% (71/105)   [Kremote: Counting objects:  68% (72/105)   [Kremote: Counting objects:  69% (73/105)   [Kremote: Counting objects:  70% (74/105)   [Kremote: Counting objects:  71% (75/105)   [Kremote: Counting objects:  72% (76/105)   [Kremote: Counting objects:  73% (77/105)   [Kremote: Counting objects:  74% (78/105)   [Kremote: Counting objects:  75% (79/105)   [Kremote: Counting objects:  76% (80/105)   [Kremote: Counting objects:  77% (81/105)   [Kremote: Counting objects:  78% (82/105)   [Kremote: Counting objects:  79% (83/105)   [Kremote: Counting objects:  80% (84/105)   [Kremote: Counting objects:  81% (86/105)   [Kremote: Counting objects:  82% (87/105)   [Kremote: Counting objects:  83% (88/105)   [Kremote: Counting objects:  84% (89/105)   [Kremote: Counting objects:  85% (90/105)   [Kremote: Counting objects:  86% (91/105)   [Kremote: Counting objects:  87% (92/105)   [Kremote: Counting objects:  88% (93/105)   [Kremote: Counting objects:  89% (94/105)   [Kremote: Counting objects:  90% (95/105)   [Kremote: Counting objects:  91% (96/105)   [Kremote: Counting objects:  92% (97/105)   [Kremote: Counting objects:  93% (98/105)   [Kremote: Counting objects:  94% (99/105)   [Kremote: Counting objects:  95% (100/105)   [Kremote: Counting objects:  96% (101/105)   [Kremote: Counting objects:  97% (102/105)   [Kremote: Counting objects:  98% (103/105)   [Kremote: Counting objects:  99% (104/105)   [Kremote: Counting objects: 100% (105/105)   [Kremote: Counting objects: 100% (105/105), done.[K
remote: Compressing objects:   1% (1/84)   [Kremote: Compressing objects:   2% (2/84)   [Kremote: Compressing objects:   3% (3/84)   [Kremote: Compressing objects:   4% (4/84)   [Kremote: Compressing objects:   5% (5/84)   [Kremote: Compressing objects:   7% (6/84)   [Kremote: Compressing objects:   8% (7/84)   [Kremote: Compressing objects:   9% (8/84)   [Kremote: Compressing objects:  10% (9/84)   [Kremote: Compressing objects:  11% (10/84)   [Kremote: Compressing objects:  13% (11/84)   [Kremote: Compressing objects:  14% (12/84)   [Kremote: Compressing objects:  15% (13/84)   [Kremote: Compressing objects:  16% (14/84)   [Kremote: Compressing objects:  17% (15/84)   [Kremote: Compressing objects:  19% (16/84)   [Kremote: Compressing objects:  20% (17/84)   [Kremote: Compressing objects:  21% (18/84)   [Kremote: Compressing objects:  22% (19/84)   [Kremote: Compressing objects:  23% (20/84)   [Kremote: Compressing objects:  25% (21/84)   [Kremote: Compressing objects:  26% (22/84)   [Kremote: Compressing objects:  27% (23/84)   [Kremote: Compressing objects:  28% (24/84)   [Kremote: Compressing objects:  29% (25/84)   [Kremote: Compressing objects:  30% (26/84)   [Kremote: Compressing objects:  32% (27/84)   [Kremote: Compressing objects:  33% (28/84)   [Kremote: Compressing objects:  34% (29/84)   [Kremote: Compressing objects:  35% (30/84)   [Kremote: Compressing objects:  36% (31/84)   [Kremote: Compressing objects:  38% (32/84)   [Kremote: Compressing objects:  39% (33/84)   [Kremote: Compressing objects:  40% (34/84)   [Kremote: Compressing objects:  41% (35/84)   [Kremote: Compressing objects:  42% (36/84)   [Kremote: Compressing objects:  44% (37/84)   [Kremote: Compressing objects:  45% (38/84)   [Kremote: Compressing objects:  46% (39/84)   [Kremote: Compressing objects:  47% (40/84)   [Kremote: Compressing objects:  48% (41/84)   [Kremote: Compressing objects:  50% (42/84)   [Kremote: Compressing objects:  51% (43/84)   [Kremote: Compressing objects:  52% (44/84)   [Kremote: Compressing objects:  53% (45/84)   [Kremote: Compressing objects:  54% (46/84)   [Kremote: Compressing objects:  55% (47/84)   [Kremote: Compressing objects:  57% (48/84)   [Kremote: Compressing objects:  58% (49/84)   [Kremote: Compressing objects:  59% (50/84)   [Kremote: Compressing objects:  60% (51/84)   [Kremote: Compressing objects:  61% (52/84)   [Kremote: Compressing objects:  63% (53/84)   [Kremote: Compressing objects:  64% (54/84)   [Kremote: Compressing objects:  65% (55/84)   [Kremote: Compressing objects:  66% (56/84)   [Kremote: Compressing objects:  67% (57/84)   [Kremote: Compressing objects:  69% (58/84)   [Kremote: Compressing objects:  70% (59/84)   [Kremote: Compressing objects:  71% (60/84)   [Kremote: Compressing objects:  72% (61/84)   [Kremote: Compressing objects:  73% (62/84)   [Kremote: Compressing objects:  75% (63/84)   [Kremote: Compressing objects:  76% (64/84)   [Kremote: Compressing objects:  77% (65/84)   [Kremote: Compressing objects:  78% (66/84)   [Kremote: Compressing objects:  79% (67/84)   [Kremote: Compressing objects:  80% (68/84)   [Kremote: Compressing objects:  82% (69/84)   [Kremote: Compressing objects:  83% (70/84)   [Kremote: Compressing objects:  84% (71/84)   [Kremote: Compressing objects:  85% (72/84)   [Kremote: Compressing objects:  86% (73/84)   [Kremote: Compressing objects:  88% (74/84)   [Kremote: Compressing objects:  89% (75/84)   [Kremote: Compressing objects:  90% (76/84)   [Kremote: Compressing objects:  91% (77/84)   [Kremote: Compressing objects:  92% (78/84)   [Kremote: Compressing objects:  94% (79/84)   [Kremote: Compressing objects:  95% (80/84)   [Kremote: Compressing objects:  96% (81/84)   [Kremote: Compressing objects:  97% (82/84)   [Kremote: Compressing objects:  98% (83/84)   [Kremote: Compressing objects: 100% (84/84)   [Kremote: Compressing objects: 100% (84/84), done.[K
Unpacking objects:   1% (1/90)   Unpacking objects:   2% (2/90)   Unpacking objects:   3% (3/90)   Unpacking objects:   4% (4/90)   Unpacking objects:   5% (5/90)   Unpacking objects:   6% (6/90)   Unpacking objects:   7% (7/90)   Unpacking objects:   8% (8/90)   Unpacking objects:  10% (9/90)   Unpacking objects:  11% (10/90)   Unpacking objects:  12% (11/90)   Unpacking objects:  13% (12/90)   Unpacking objects:  14% (13/90)   Unpacking objects:  15% (14/90)   Unpacking objects:  16% (15/90)   Unpacking objects:  17% (16/90)   Unpacking objects:  18% (17/90)   Unpacking objects:  20% (18/90)   Unpacking objects:  21% (19/90)   Unpacking objects:  22% (20/90)   Unpacking objects:  23% (21/90)   Unpacking objects:  24% (22/90)   Unpacking objects:  25% (23/90)   Unpacking objects:  26% (24/90)   Unpacking objects:  27% (25/90)   Unpacking objects:  28% (26/90)   Unpacking objects:  30% (27/90)   Unpacking objects:  31% (28/90)   Unpacking objects:  32% (29/90)   Unpacking objects:  33% (30/90)   Unpacking objects:  34% (31/90)   Unpacking objects:  35% (32/90)   Unpacking objects:  36% (33/90)   Unpacking objects:  37% (34/90)   Unpacking objects:  38% (35/90)   Unpacking objects:  40% (36/90)   Unpacking objects:  41% (37/90)   Unpacking objects:  42% (38/90)   Unpacking objects:  43% (39/90)   Unpacking objects:  44% (40/90)   Unpacking objects:  45% (41/90)   Unpacking objects:  46% (42/90)   Unpacking objects:  47% (43/90)   Unpacking objects:  48% (44/90)   Unpacking objects:  50% (45/90)   remote: Total 90 (delta 49), reused 0 (delta 0)[K
Unpacking objects:  51% (46/90)   Unpacking objects:  52% (47/90)   Unpacking objects:  53% (48/90)   Unpacking objects:  54% (49/90)   Unpacking objects:  55% (50/90)   Unpacking objects:  56% (51/90)   Unpacking objects:  57% (52/90)   Unpacking objects:  58% (53/90)   Unpacking objects:  60% (54/90)   Unpacking objects:  61% (55/90)   Unpacking objects:  62% (56/90)   Unpacking objects:  63% (57/90)   Unpacking objects:  64% (58/90)   Unpacking objects:  65% (59/90)   Unpacking objects:  66% (60/90)   Unpacking objects:  67% (61/90)   Unpacking objects:  68% (62/90)   Unpacking objects:  70% (63/90)   Unpacking objects:  71% (64/90)   Unpacking objects:  72% (65/90)   Unpacking objects:  73% (66/90)   Unpacking objects:  74% (67/90)   Unpacking objects:  75% (68/90)   Unpacking objects:  76% (69/90)   Unpacking objects:  77% (70/90)   Unpacking objects:  78% (71/90)   Unpacking objects:  80% (72/90)   Unpacking objects:  81% (73/90)   Unpacking objects:  82% (74/90)   Unpacking objects:  83% (75/90)   Unpacking objects:  84% (76/90)   Unpacking objects:  85% (77/90)   Unpacking objects:  86% (78/90)   Unpacking objects:  87% (79/90)   Unpacking objects:  88% (80/90)   Unpacking objects:  90% (81/90)   Unpacking objects:  91% (82/90)   Unpacking objects:  92% (83/90)   Unpacking objects:  93% (84/90)   Unpacking objects:  94% (85/90)   Unpacking objects:  95% (86/90)   Unpacking objects:  96% (87/90)   Unpacking objects:  97% (88/90)   Unpacking objects:  98% (89/90)   Unpacking objects: 100% (90/90)   Unpacking objects: 100% (90/90), done.
From ssh://remote.cs.binghamton.edu/~umrigar/git-repos/cs240
   0b7b862..5dd8253  master     -> origin/master
Updating 0b7b862..5dd8253
Fast-forward
 index.html                                  |  24 [32m+[m[31m-[m
 index.umt                                   |   6 [32m+[m
 labs/index.html                             |   4 [32m+[m[31m-[m
 labs/index.umt                              |   9 [32m+[m[31m-[m
 labs/lab2/exercises/.gitignore              |   1 [32m+[m
 labs/lab2/exercises/1-hello/.gitignore      |   1 [32m+[m
 labs/lab2/exercises/1-hello/Makefile        |   3 [32m+[m
 labs/lab2/exercises/1-hello/README          |   1 [32m+[m
 labs/lab2/exercises/1-hello/hello.cc        |  22 [32m++[m
 labs/lab2/exercises/2-hello/.gitignore      |   1 [32m+[m
 labs/lab2/exercises/2-hello/Makefile        |   3 [32m+[m
 labs/lab2/exercises/2-hello/README          |   4 [32m+[m
 labs/lab2/exercises/2-hello/hello.cc        |  48 [32m++++[m
 labs/lab2/exercises/3-overload/.gitignore   |   1 [32m+[m
 labs/lab2/exercises/3-overload/Makefile     |   3 [32m+[m
 labs/lab2/exercises/3-overload/overload.cc  |  16 [32m++[m
 labs/lab2/exercises/Makefile                |   2 [32m+[m
 labs/lab2/lab2.html                         | 257 [32m++++++++++++++++++++[m
 labs/lab2/lab2.pdf                          | Bin [31m0[m -> [32m93531[m bytes
 labs/lab2/lab2.umt                          | 358 [32m++++++++++++++++++++++++++++[m
 labs/lab2/lab2/hl-fine_blue.css             |  19 [32m++[m
 labs/lab2/lab2/hl-fine_blue.sty             |  19 [32m++[m
 labs/submission/submission/hl-fine_blue.css |   2 [32m+[m[31m-[m
 labs/submission/submission/hl-fine_blue.sty |   2 [32m+[m[31m-[m
 slides/c++-intro/c++-intro.html             | 228 [32m++++++++++++++[m[31m----[m
 slides/c++-intro/c++-intro.pdf              | Bin [31m167175[m -> [32m201292[m bytes
 slides/c++-intro/c++-intro.umt              | 148 [32m+++++++++++[m[31m-[m
 slides/c++-intro/c++-intro/hl-fine_blue.css |   2 [32m+[m[31m-[m
 slides/c++-intro/c++-intro/hl-fine_blue.sty |   2 [32m+[m[31m-[m
 slides/c++-intro/code/.gitignore            |   6 [32m+[m
 slides/c++-intro/code/Makefile              |  12 [32m+[m[31m-[m
 slides/c++-intro/code/alloc-dealloc.cc      |  26 [32m++[m
 slides/c++-intro/code/class-point.cc        |  33 [32m+++[m
 slides/c++-intro/code/struct-point.cc       |  31 [32m+++[m
 slides/c++-intro/code/sum-array.cc          |  14 [32m+[m[31m-[m
 slides/c++-intro/code/vec1.cc               |  40 [32m++++[m
 36 files changed, 1266 insertions(+), 82 deletions(-)
 create mode 100644 labs/lab2/exercises/.gitignore
 create mode 100644 labs/lab2/exercises/1-hello/.gitignore
 create mode 100644 labs/lab2/exercises/1-hello/Makefile
 create mode 100644 labs/lab2/exercises/1-hello/README
 create mode 100644 labs/lab2/exercises/1-hello/hello.cc
 create mode 100644 labs/lab2/exercises/2-hello/.gitignore
 create mode 100644 labs/lab2/exercises/2-hello/Makefile
 create mode 100644 labs/lab2/exercises/2-hello/README
 create mode 100644 labs/lab2/exercises/2-hello/hello.cc
 create mode 100644 labs/lab2/exercises/3-overload/.gitignore
 create mode 100644 labs/lab2/exercises/3-overload/Makefile
 create mode 100644 labs/lab2/exercises/3-overload/overload.cc
 create mode 100644 labs/lab2/exercises/Makefile
 create mode 100644 labs/lab2/lab2.html
 create mode 100644 labs/lab2/lab2.pdf
 create mode 100644 labs/lab2/lab2.umt
 create mode 100644 labs/lab2/lab2/hl-fine_blue.css
 create mode 100644 labs/lab2/lab2/hl-fine_blue.sty
 create mode 100644 slides/c++-intro/code/.gitignore
 create mode 100644 slides/c++-intro/code/alloc-dealloc.cc
 create mode 100644 slides/c++-intro/code/class-point.cc
 create mode 100644 slides/c++-intro/code/struct-point.cc
 create mode 100644 slides/c++-intro/code/vec1.cc
rblazej1@g7-10:~/cs240$ cd exercises[K[K[K[K[K[K[K[K[Klabs
rblazej1@g7-10:~/cs240/labs$ ls
index.html  index.umt  lab0  lab1  lab2  submission
rblazej1@g7-10:~/cs240/labs$ cd ..
rblazej1@g7-10:~/cs240$ cd ..
rblazej1@g7-10:~$ cd i240a
rblazej1@g7-10:~/i240a$ 
rblazej1@g7-10:~/i240a$ cd submit
rblazej1@g7-10:~/i240a/submit$ cd lab2
rblazej1@g7-10:~/i240a/submit/lab2$ cd lab2submit[1Pi240a[3P..[3Plscd labsgit pullls[Kcd cs240ls[Kcd ..p -r ~/cs240/labs/lab2/exercises/* .
rblazej1@g7-10:~/i240a/submit/lab2$ ls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
rblazej1@g7-10:~/i240a/submit/lab2$ cd 1-hello
rblazej1@g7-10:~/i240a/submit/lab2/1-hello$ ls -l
total 12
-rw-r--r-- 1 rblazej1 rblazej1 363 Feb  6 13:14 hello.cc
-rw-r--r-- 1 rblazej1 rblazej1  39 Feb  6 13:14 Makefile
-rw-r--r-- 1 rblazej1 rblazej1  61 Feb  6 13:14 README
rblazej1@g7-10:~/i240a/submit/lab2/1-hello$ gedit README
rblazej1@g7-10:~/i240a/submit/lab2/1-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
rblazej1@g7-10:~/i240a/submit/lab2/1-hello$ ./hello
usage: ./hello NAME...
rblazej1@g7-10:~/i240a/submit/lab2/1-hello$ ./hello bart lisa
hello bart
hello lisa
hello rblazej1@g7-10:~/i240a/submit/lab2/1-hello$ gdb
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word".
(gdb) str[Kart bat[Krt lisa
No symbol table loaded.  Use the "file" command.
(gdb) l
No symbol table is loaded.  Use the "file" command.
(gdb) file
No executable file now.
No symbol file now.
(gdb) q
rblazej1@g7-10:~/i240a/submit/lab2/1-hello$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bart lisa
Temporary breakpoint 1 at 0x11cd: file hello.cc, line 13.
Starting program: /import/linux/home1/rblazej1/projects/i240a/submit/lab2/1-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe778) at hello.cc:13
13	  if (argc == 1) {
(gdb) l
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
(gdb) b sayHello
Breakpoint 2 at 0x555555555181: file hello.cc, line 7.
(gdb) p argc
$1 = 3
(gdb) p argv
$2 = (const char **) 0x7fffffffe778
(gdb) p argv[0]
$3 = 0x7fffffffea61 "/import/linux/home1/rblazej1/projects/i240a/submit/lab2/1-hello/hello"
(gdb) p argv]1[K[K[1]
$4 = 0x7fffffffeaa7 "bart"
(gdb) p argv[2]
$5 = 0x7fffffffeaac "lisa"
(gdb) p *argv@3
$6 = {
  0x7fffffffea61 "/import/linux/home1/rblazej1/projects/i240a/submit/lab2/1-hello/hello", 0x7fffffffeaa7 "bart", 0x7fffffffeaac "lisa"}
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) n
19	      sayHello(argv[i]);
(gdb) p i
$7 = 1
(gdb) c
Continuing.

Breakpoint 2, sayHello (name=0x7fffffffeaa7 "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) l
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
11	main(int argc, const char *argv[])
(gdb) backtrace
#0  sayHello (name=0x7fffffffeaa7 "bart") at hello.cc:7
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe778) at hello.cc:19
(gdb) p argc
No symbol "argc" in current context.
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe778) at hello.cc:19
19	      sayHello(argv[i]);
(gdb) upp argc
$8 = 3
(gdb) down
#0  sayHello (name=0x7fffffffeaa7 "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) p name
$9 = 0x7fffffffeaa7 "bart"
(gdb) c
Continuing.
hello bart

Breakpoint 2, sayHello (name=0x7fffffffeaac "lisa") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) cp name
$10 = 0x7fffffffeaac "lisa"
(gdb) c
Continuing.
hello lisa

Breakpoint 2, sayHello (name=0x0) at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) cp name
$11 = 0x0
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe778) at hello.cc:19
19	      sayHello(argv[i]);
(gdb) p i
$12 = 3
(gdb) p argc
$13 = 3
(gdb) q
A debugging session is active.

	Inferior 1 [process 329659] will be killed.

Quit anyway? (y or n) y
rblazej1@g7-10:~/i240a/submit/lab2/1-hello$ gedit [K[K[K[K[K[Kls
hello  hello.cc  Makefile  README
rblazej1@g7-10:~/i240a/submit/lab2/1-hello$ gedit hello.cc

(gedit:330115): Gtk-[1;33mWARNING[0m **: [34m13:21:10.893[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist

rblazej1@g7-10:~/i240a/submit/lab2/1-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
rblazej1@g7-10:~/i240a/submit/lab2/1-hello$ ./ell[K[K[Khello a[Kbart lisa
hello bart
hello lisa
rblazej1@g7-10:~/i240a/submit/lab2/1-hello$ cd ..
rblazej1@g7-10:~/i240a/submit/lab2$ cd 2-hello
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ h[Kmake
g++ -g -Wall -std=c++17    hello.cc   -o hello
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./hello lisa bart
Hello Lisa
Hello Bart
Segmentation fault
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./hello 'lisa simpson' 'bart simpson '
Hello Lisa SimpsonV
Hello Bart SimpsonV
Segmentation fault
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start lisa bart
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/rblazej1/projects/i240a/submit/lab2/2-hello/hello lisa bart

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe778) at hello.cc:36
36	  if (argc == 1) {
(gdb) l
31	
32	
33	int
34	main(int argc, const char *argv[])
35	{
36	  if (argc == 1) {
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
(gdb) n
41	    for (int i = 1; i <= argc; i++) {
(gdb) n
46	    }
(gdb) n
42	      const char *name = argv[i];
(gdb) n
43	      char friendlyName[strlen(name)];
(gdb) n
44	      upcaseWords(name, friendlyName);
(gdb) n
45	      sayHello(friendlyName);
(gdb) n
Hello Lisa
41	    for (int i = 1; i <= argc; i++) {
(gdb) b sayHello
Breakpoint 2 at 0x55555555528c: file hello.cc, line 29.
(gdb) c
Continuing.

Breakpoint 2, sayHello (name=0x7fffffffe620 "Bart") at hello.cc:29
29	  std::cout << "Hello " << name << std::endl;
(gdb) l
24	}
25	
26	static void
27	sayHello(const char *name)
28	{
29	  std::cout << "Hello " << name << std::endl;
30	}
31	
32	
33	int
(gdb) p argc
No symbol "argc" in current context.
(gdb) up
#1  0x00005555555553f3 in main (argc=3, argv=0x7fffffffe778) at hello.cc:45
45	      sayHello(friendlyName);
(gdb) p argc
$1 = 3
(gdb) p *argv@3
$2 = {
  0x7fffffffea61 "/import/linux/home1/rblazej1/projects/i240a/submit/lab2/2-hello/hello", 0x7fffffffeaa7 "lisa", 0x7fffffffeaac "bart"}
(gdb) c
Continuing.
Hello Bart

Program received signal SIGSEGV, Segmentation fault.
__strlen_sse2 () at ../sysdeps/x86_64/multiarch/../strlen.S:120
120	../sysdeps/x86_64/multiarch/../strlen.S: No such file or directory.
(gdb) l[Kl
115	in ../sysdeps/x86_64/multiarch/../strlen.S
(gdb) l
115	in ../sysdeps/x86_64/multiarch/../strlen.S
(gdb) n

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) c
The program is not being run.
(gdb) q
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start lisa bart
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/rblazej1/projects/i240a/submit/lab2/2-hello/hello lisa bart

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe778) at hello.cc:36
36	  if (argc == 1) {
(gdb) l
31	
32	
33	int
34	main(int argc, const char *argv[])
35	{
36	  if (argc == 1) {
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
(gdb) l[Kl 10
5	
6	/** Upcase the initial letter of each word from in, copying the
7	 *  results into out.  The caller is responsible to ensure that out
8	 *  has enough space for the strlen(in) characters of in.
9	 */
10	void
11	upcaseWords(const char in[], char out[])
12	{
13	  bool inWord = false;
14	  const int n = std::strlen(in);
(gdb) l 18
13	  bool inWord = false;
14	  const int n = std::strlen(in);
15	  for (int i = 0; i < n; i++) {
16	    if (!inWord && std::isalpha(in[i])) {
17	      out[i] = std::toupper(in[i]);
18	    }
19	    else {
20	      out[i] = in[i];
21	    }
22	    inWord = std::isalpha(in[i]);
(gdb) l 26
21	    }
22	    inWord = std::isalpha(in[i]);
23	  }
24	}
25	
26	static void
27	sayHello(const char *name)
28	{
29	  std::cout << "Hello " << name << std::endl;
30	}
(gdb) l 35
30	}
31	
32	
33	int
34	main(int argc, const char *argv[])
35	{
36	  if (argc == 1) {
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
(gdb) l 46[K5
40	  else {
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) p arg
$1 = {void (const char *, const char *, const char *, argp_fmtstream_t, 
    const argp_option *, const argp_option *)} 0x7ffff7bb73d0 <arg>
(gdb) p argc
$2 = 3
(gdb) b main
Breakpoint 2 at 0x5555555552e1: file hello.cc, line 36.
(gdb) c
Continuing.
Hello Lisa
Hello Bart

Program received signal SIGSEGV, Segmentation fault.
__strlen_sse2 () at ../sysdeps/x86_64/multiarch/../strlen.S:120
120	../sysdeps/x86_64/multiarch/../strlen.S: No such file or directory.
(gdb) l 10
5	../sysdeps/x86_64/multiarch/../strlen.S: No such file or directory.
(gdb) l
5	in ../sysdeps/x86_64/multiarch/../strlen.S
(gdb) c
Continuing.

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) q
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ gedit hello

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:21.822[0m: gtk_widget_get_mapped: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gdk-[1;35mCRITICAL[0m **: [34m13:30:21.822[0m: gdk_window_is_visible: assertion 'GDK_IS_WINDOW (window)' failed

(gedit:331139): Gdk-[1;35mCRITICAL[0m **: [34m13:30:21.822[0m: gdk_window_show_internal: assertion 'GDK_IS_WINDOW (window)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:21.822[0m: gtk_widget_set_opacity: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:21.822[0m: gtk_widget_queue_draw: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:21.826[0m: gtk_widget_get_mapped: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gdk-[1;35mCRITICAL[0m **: [34m13:30:21.826[0m: gdk_window_is_visible: assertion 'GDK_IS_WINDOW (window)' failed

(gedit:331139): Gdk-[1;35mCRITICAL[0m **: [34m13:30:21.826[0m: gdk_window_show_internal: assertion 'GDK_IS_WINDOW (window)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:21.826[0m: gtk_widget_set_opacity: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:21.826[0m: gtk_widget_queue_draw: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:24.083[0m: gtk_widget_get_mapped: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gdk-[1;35mCRITICAL[0m **: [34m13:30:24.083[0m: gdk_window_is_visible: assertion 'GDK_IS_WINDOW (window)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:24.083[0m: gtk_widget_set_opacity: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:24.083[0m: gtk_widget_queue_draw: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): GLib-GObject-[1;33mWARNING[0m **: [34m13:30:25.110[0m: invalid unclassed pointer in cast to 'GeditOpenDocumentSelector'

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:25.110[0m: gtk_list_store_clear: assertion 'GTK_IS_LIST_STORE (list_store)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:25.110[0m: gtk_widget_set_visible: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:25.110[0m: gtk_widget_set_visible: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): GLib-GObject-[1;33mWARNING[0m **: [34m13:30:25.110[0m: invalid unclassed pointer in cast to 'GeditOpenDocumentSelector'

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:25.110[0m: gtk_list_store_clear: assertion 'GTK_IS_LIST_STORE (list_store)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:25.110[0m: gtk_widget_set_visible: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:25.110[0m: gtk_widget_set_visible: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:25.119[0m: gtk_widget_get_mapped: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gdk-[1;35mCRITICAL[0m **: [34m13:30:25.119[0m: gdk_window_is_visible: assertion 'GDK_IS_WINDOW (window)' failed

(gedit:331139): Gdk-[1;35mCRITICAL[0m **: [34m13:30:25.119[0m: gdk_window_show_internal: assertion 'GDK_IS_WINDOW (window)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:25.119[0m: gtk_widget_set_opacity: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:331139): Gtk-[1;35mCRITICAL[0m **: [34m13:30:25.119[0m: gtk_widget_queue_draw: assertion 'GTK_IS_WIDGET (widget)' failed
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ls
hello  hello.cc  Makefile  README
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ gedit hello.cc

(gedit:331212): Gtk-[1;33mWARNING[0m **: [34m13:30:44.658[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist

rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ makegedit hello.cc

(gedit:331314): Gtk-[1;33mWARNING[0m **: [34m13:31:35.639[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist

rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./helo[Klo lisa bart
Hello Lis
Hello Bar
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./hello lisa bartmake[Kgedit hello.cc

(gedit:331393): Gtk-[1;33mWARNING[0m **: [34m13:31:59.874[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist

rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ gedit hello.cc./hello lisa bartmake[K
g++ -g -Wall -std=c++17    hello.cc   -o hello
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ makegedit hello.cc./hello lisa bart
Hello Lisa
Hello Bart
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./hello 'lisa simpson' 'bart simpson '
Hello Lisa Simpson×U
Hello Bart Simpson×U
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[Kgedit hello.cc

(gedit:331467): Gtk-[1;33mWARNING[0m **: [34m13:33:31.234[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist

rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ gedit hello.cc./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
g++ -g -Wall -std=c++17    hello.cc   -o hello
^[[A^[[Arblazej1@g7-10:~/i240a/submit/lab2/2-hello$ makegedit hello.cc./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Hello Lisa
Hello Bart
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./hello lisa bartmake[Kgedit hello.cc./hello 'lisa simpson' 'bart simpson'
Hello Lisa SimpsonfU
Hello Bart SimpsonfU
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./hello 'lisa simpson' 'bart simpson'
Hello Lisa Simpson$V
Hello Bart Simpson$V
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[Kgedit hello.cc

(gedit:331627): Gtk-[1;33mWARNING[0m **: [34m13:35:26.971[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist

rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ gedit hello.cc./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
g++ -g -Wall -std=c++17    hello.cc   -o hello
^[[Arblazej1@g7-10:~/i240a/submit/lab2/2-hello$ makegedit hello.cc./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Hello Lisa
Hello Bart
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./hello lisa bartmake[Kgedit hello.cc./hello 'lisa simpson' 'bart simpson'
Hello Lisa Simpson´U
Hello Bart Simpson´U
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[Kgedit hello.cc

(gedit:331870): Gtk-[1;33mWARNING[0m **: [34m13:35:58.899[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist

rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ gedit hello.cc./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
g++ -g -Wall -std=c++17    hello.cc   -o hello
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ makegedit hello.cc./hello 'lisa simpson' 'bart simpson'
Hello Lisa SimpsoÜU
Hello Bart SimpsoÜU
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cgedit hello.cc

(gedit:331915): Gtk-[1;33mWARNING[0m **: [34m13:36:16.957[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist

rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ makegedit hello.cc./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
make: 'hello' is up to date.
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ makegedit hello.cc./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cgedit hello.cc./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Hello Lisa
Hello Bart
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ ./hello lisa bartmake[Kgedit hello.cc./hello 'lisa simpson' 'bart simpson'
Hello Lisa Simpson
Hello Bart Simpson
rblazej1@g7-10:~/i240a/submit/lab2/2-hello$ cd ..
rblazej1@g7-10:~/i240a/submit/lab2$ cd 3-overload
rblazej1@g7-10:~/i240a/submit/lab2/3-overload$ gedit overload.cc
rblazej1@g7-10:~/i240a/submit/lab2/3-overload$ make
g++ -g -Wall -std=c++17    overload.cc   -o overload
rblazej1@g7-10:~/i240a/submit/lab2/3-overload$ ./overload
f(a) = 3; f(&a) = 4; f(a, b) = -1
rblazej1@g7-10:~/i240a/submit/lab2/3-overload$ gdb overload
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from overload...done.
(gdb) b f(int
f(int)       f(int*)      f(int, int)  
(gdb) b f(int
f(int)       f(int*)      f(int, int)  
(gdb) b f(int*)
Breakpoint 1 at 0x117d: file overload.cc, line 3.
(gdb) r
Starting program: /import/linux/home1/rblazej1/projects/i240a/submit/lab2/3-overload/overload 

Breakpoint 1, f (a=0x7fffffffe678) at overload.cc:3
3	int f(int *a) { return *a * 2; }
(gdb) p a
$1 = (int *) 0x7fffffffe678
(gdb) p *a
$2 = 2
(gdb) p *a=5
$3 = 5
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /import/linux/home1/rblazej1/projects/i240a/submit/lab2/3-overload/overload 

Breakpoint 1, f (a=0x7fffffffe678) at overload.cc:3
3	int f(int *a) { return *a * 2; }
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) n
Program not restarted.
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /import/linux/home1/rblazej1/projects/i240a/submit/lab2/3-overload/overload 

Breakpoint 1, f (a=0x7fffffffe678) at overload.cc:3
3	int f(int *a) { return *a * 2; }
(gdb) p *a
$4 = 2
(gdb) q
A debugging session is active.

	Inferior 1 [process 332824] will be killed.

Quit anyway? (y or n) y
rblazej1@g7-10:~/i240a/submit/lab2/3-overload$ cd ..
rblazej1@g7-10:~/i240a/submit/lab2$ ls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
rblazej1@g7-10:~/i240a/submit/lab2$ exit

Script done on 2020-02-06 13:44:01-05:00 [COMMAND_EXIT_CODE="0"]
